# BasepointAngletonParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BasepointAngletonParam Property
ParameterTypeId Class See Also
---
"Angle to True North"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BasepointAngletonParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BasepointAngletonParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BasepointAngletonParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace